Tutorial3/Scale1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(


    (-5 	0.01 	-13)
    (1015 	0.01	-13)
    (1015 	1600.01  -13)
    (-5 	1600.01	-13)
    (-5		0.01 	1247)//z1247
    (1015 	0.01 	1247)
    (1015 	1600.01 	1247)//y0.5
    (-5 	1600.01 	1247)

   
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ( 51  80  63) simpleGrading (1 1 1)//1 M cells 102 155 125    40 62 50
);

edges
(
);

patches
(
   
wall vessel
    (
	(0 4 7 3)
       	(0 3 2 1)
	(1 5 4 0)//inlet
 	(2 6 5 1)
	(3 7 6 2)
	(4 5 6 7)//outlet
	      	    )
patch outlet
    (
	//(4 5 6 7)
      	    )
patch inlet
	(
	//(1 5 4 0)
	)
);

);



mergePatchPairs
(
);

// ************************************************************************* //
