Tutorial3/Scale1/system/setFieldsDict.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
     volScalarFieldValue alpha.air 1
    );

regions
(
    boxToCell
    {
        box (-1 -1 -1) (0.5 1.0001 0.7);
       fieldValues
        (
             volScalarFieldValue alpha.air 0
                    );
    }
);


// ************************************************************************* //
